#include "delay.h"
/*------------------------------------------------
 uS延时函数大致延时T=tx2+5 uS 
------------------------------------------------*/
void DelayUs2x(unsigned char t)
{   
 while(--t);
}
/*------------------------------------------------
 mS延时函数
------------------------------------------------*/
void DelayMs(unsigned char t)
{
     
 while(t--)
 {
     //大致延时1mS
     DelayUs2x(245);
	 DelayUs2x(245);
 }
 }
 /*------------------------------------------------
 mS延时函数
------------------------------------------------*/
void DelayS(unsigned char t)
{
     
 while(t--)
 {
     //大致延时1S
     DelayMs(250);
	 DelayMs(250);
	 DelayMs(250);
	 DelayMs(250);
 }
}
